from config import OWNER_USERNAME, SUPPORT_GRP
from nexichat import nexichat
from pyrogram import Client, filters



START = '''```
๏ ᴛнιѕ ιѕ【◖ 𝗦υρєяƒαѕτ ◗ 】ϲнαᴛʙοᴛ ๏```

**➪ ꜱᴜᴘᴘᴏʀᴛꜱ: ᴛᴇxᴛ, ꜱᴛɪᴄᴋᴇʀ, ꜰɪʟᴇꜱ, ᴘʜᴏᴛᴏ, ᴠɪᴅᴇᴏ
➪ ᴍᴜʟᴛɪ-ʟᴀɴɢᴜᴀɢᴇ: /setlang
➪ ᴇɴᴀʙʟᴇ/ᴅɪꜱᴀʙʟᴇ ᴄʜᴀᴛʙᴏᴛ: /chatbot
➪ ᴄʀᴇᴀᴛᴇ ʏᴏᴜʀ ᴏᴡɴ ʙᴏᴛ: /clone
➪ ɢᴇɴᴇʀᴀᴛᴇ ɪᴅ-ʙᴏᴛ: /idclone

๏ ᴜꜱᴇʀꜱ: {}
๏ ᴄʜᴀᴛꜱ: {}
๏ ᴜᴘᴛɪᴍᴇ: {}

╔═════════════════╗
║ ˹ ᴀʟʟ ʙᴏᴛs ˼ ➪ [ᴄʟɪᴄᴋ ʜᴇʀᴇ](https://t.me/The_Incricible/817)
║ ˹ ᴅᴇᴠ ˼ ➪ [мɪcҡεʏ](https://t.me/LEGEND_MICKEY)         
╚═════════════════╝
**'''

HELP_READ = '''```
**Cʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ʙᴇʟᴏᴡ ғᴏʀ ᴍᴏʀᴇ ɪɴғᴏʀᴍᴀᴛɪᴏɴ.  Iғ ʏᴏᴜ'ʀᴇ ғᴀᴄɪɴɢ ᴀɴʏ ᴘʀᴏʙʟᴇᴍ ʏᴏᴜ ᴄᴀɴ ᴀsᴋ ɪɴ [sᴜᴘᴘᴏʀᴛ ᴄʜᴀᴛ](https://t.me/kittyxupdates).

Aʟʟ ᴄᴏᴍᴍᴀɴᴅs ᴄᴀɴ ʙᴇ ᴜsᴇᴅ ᴡɪᴛʜ: /```**
"""'''

TOOLS_DATA_READ = '''```
๏ ᴄᴏᴍᴍᴀɴᴅs ᴏꜰ ᴛʜᴇ ᴛᴏᴏʟs ๏```

➻ /start – ᴡᴀᴋᴇ ᴛʜᴇ ʙᴏᴛ ᴀɴᴅ ɢᴇᴛ ᴀ ᴡᴇʟᴄᴏᴍᴇ ᴍᴇssᴀɢᴇ!
──────────────
➻ /help – ᴠɪᴇᴡ ᴀʟʟ ᴄᴏᴍᴍᴀɴᴅs ᴀɴᴅ ғᴇᴀᴛᴜʀᴇs ᴏғ ᴛʜᴇ ʙᴏᴛ.
──────────────
➻ /ping – ᴄʜᴇᴄᴋ ʙᴏᴛ ʀᴇsᴘᴏɴsᴇ ᴛɪᴍᴇ (ᴘɪɴɢ).
──────────────
➻ /id – ɢᴇᴛ ᴜsᴇʀ, ᴄʜᴀᴛ, ᴀɴᴅ ᴍᴇssᴀɢᴇ ɪᴅ ɪɴ ᴀ sɪɴɢʟᴇ ᴍᴇssᴀɢᴇ.
──────────────
➻ /broadcast – ғᴏʀᴡᴀʀᴅ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ ᴀʟʟ ᴄʜᴀᴛs.
ᴇxᴀᴍᴘʟᴇ: /broadcast -user -pin ʜᴇʟʟᴏ ғʀɪᴇɴᴅs
──────────────
➻ /shayri – ɢᴇᴛ ʀᴀɴᴅᴏᴍ sʜᴀʏʀɪ ғᴏʀ ʟᴏᴠᴇʀs.
──────────────
➻ /link (ɢʀᴏᴜᴘ ɪᴅ) – ɢᴇᴛ ɢʀᴏᴜᴘ ʟɪɴᴋ.
➻ /givelink – ᴏʙᴛᴀɪɴ ᴄᴜʀʀᴇɴᴛ ɢʀᴏᴜᴘ ʟɪɴᴋ ᴡʜᴇʀᴇ ᴛʜᴇ ᴄᴏᴍᴍᴀɴᴅ ɪs ᴜsᴇᴅ.
──────────────
➻ /repo – ᴄʜᴇᴄᴋ ᴛʜᴇ ʙᴏᴛ's sᴏᴜʀᴄᴇ ᴄᴏᴅᴇ.
──────────────
๏ ᴅᴇᴠ ➪  [мɪcҡεʏ](https://t.me/LEGEND_MICKEY) **
'''

CHATBOT_READ = '''```
๏ ᴄʜᴀᴛʙᴏᴛ ᴄᴏᴍᴍᴀɴᴅs ๏```

➻ /chatbot – ᴛᴏɢɢʟᴇ ᴄʜᴀᴛʙᴏᴛ (ᴇɴᴀʙʟᴇ/ᴅɪsᴀʙʟᴇ).
──────────────
➻ /ask – ᴀꜱᴋ ᴀɴʏ ǫᴜᴇsᴛɪᴏɴ ғʀᴏᴍ ᴄʜᴀᴛɢᴘᴛ.
──────────────
➻ /lang, /language, /setlang – ᴏᴘᴇɴ ᴍᴇɴᴜ ᴛᴏ sᴇʟᴇᴄᴛ ʟᴀɴɢᴜᴀɢᴇ ғᴏʀ ᴄʜᴀᴛ.
──────────────
➻ /resetlang, /nolang – ʀᴇsᴇᴛ ᴛʜᴇ ʟᴀɴɢᴜᴀɢᴇ ᴛᴏ ᴍɪxᴇᴅ ᴍᴏᴅᴇ.
──────────────
➻ /chatlang – ᴄʜᴇᴄᴋ ᴛʜᴇ ᴄᴜʀʀᴇɴᴛ ᴄʜᴀᴛ ʟᴀɴɢᴜᴀɢᴇ.
──────────────
➻ /status – ᴠɪᴇᴡ ᴄʜᴀᴛʙᴏᴛ's ᴄᴜʀʀᴇɴᴛ sᴛᴀᴛᴜs (ᴀᴄᴛɪᴠᴇ/ɪɴᴀᴄᴛɪᴠᴇ).
──────────────
➻ /stats – ᴅɪsᴘʟᴀʏ ʙᴏᴛ ᴜsᴀɢᴇ ꜱᴛᴀᴛɪsᴛɪᴄs.
──────────────
➻ /clone [ʙᴏᴛ ᴛᴏᴋᴇɴ] – ᴄʟᴏɴᴇ ᴀ ʙᴏᴛ ᴜsɪɴɢ ʏᴏᴜʀ ᴛᴏᴋᴇɴ.
──────────────
➻ /idclone [ᴘʏʀᴏɢʀᴀᴍ ꜱᴛʀɪɴɢ ꜱᴇssɪᴏɴ] – ᴄʀᴇᴀᴛᴇ ᴀɴ ɪᴅ-ᴄʜᴀᴛʙᴏᴛ ᴜsɪɴɢ ᴀ ꜱᴛʀɪɴɢ ꜱᴇssɪᴏɴ.
──────────────

[мɪcҡεʏ](https://t.me/LEGEND_MICKEY) **
'''

SOURCE_READ = '''```
๏ ѕυρєя ғᴀsτ【◖ 𝗖υτє 𝗭ογυ ◗ 】ϲнαᴛʙοᴛ ๏```

**❖ ʜᴇʀᴇ ᴏᴜʀ ᴀʟʟ ʙᴏᴛ ᴀʟɪᴠᴇ ᴀʟʟ ʙᴏᴛ ʀᴇᴘᴏ ɪs ᴘʀɪᴠᴀᴛᴇ ᴊᴏɪɴ ᴄʜᴀɴɴᴇʟ [˹ ᴧʟʟ ʙσᴛ's ˼](https://t.me/The_Incricible/817)**'''

ADMIN_READ = f"sᴏᴏɴ"

ABOUT_READ = f"""
**➻ [{nexichat.name}](https://t.me/{nexichat.username}) ɪs ᴀɴ ᴀɪ ʙᴀsᴇᴅ ᴄʜᴀᴛ-ʙᴏᴛ.**
**➻ [{nexichat.name}](https://t.me/{nexichat.username}) ʀᴇᴘʟɪᴇs ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ ᴛᴏ ᴀ ᴜsᴇʀ.**
**➻ ʜᴇʟᴘs ʏᴏᴜ ɪɴ ᴀᴄᴛɪᴠᴀᴛɪɴɢ ʏᴏᴜʀ ɢʀᴏᴜᴘs.**
**➻ ᴡʀɪᴛᴛᴇɴ ɪɴ [ᴘʏᴛʜᴏɴ](https://www.python.org) ᴡɪᴛʜ [ᴍᴏɴɢᴏ-ᴅʙ](https://www.mongodb.com) ᴀs ᴀ ᴅᴀᴛᴀʙᴀsᴇ**
**──────────────**
**➻ ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ɢɪᴠᴇɴ ʙᴇʟᴏᴡ ғᴏʀ ɢᴇᴛᴛɪɴɢ ʙᴀsɪᴄ ʜᴇʟᴩ ᴀɴᴅ ɪɴғᴏ ᴀʙᴏᴜᴛ [{nexichat.name}](https://t.me/{nexichat.username})**
"""
